conf/src/AccumulationRegisters/ЭП_ОстаткиНаСкладе/ЭП_ОстаткиНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ОстаткиНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/AccumulationRegisters/ЭП_ОстаткиНаСотрудниках/ЭП_ОстаткиНаСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ОстаткиНаСотрудниках</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/AccumulationRegisters/ЭП_ОстаткиНаСкладе/ManagerModule.bsl
Функция ПолучитьДанныеВыбораИнвентарныйНомер(Знач ИнвентарныйНомер, Знач Номенклатура, Знач Склад, Знач РежимРаботы, Знач Сотрудник, Знач ВидНоменклатуры) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
			
	Если ИнвентарныйНомер = "" и РежимРаботы = "" и  Сотрудник = "" Тогда 
		//  Инвентарный номер - склад, склад - Инвентарный номер
		//  Ветка для подбора инвентарных номеров без привязки к складу и сотруднику
		ИнвентарныйНомер = Склад; 
		
		Если НЕ ЗначениеЗаполнено(СокрЛП(ИнвентарныйНомер)) Тогда
			Возврат Неопределено;    
		Иначе
			ИнвентарныйНомер =  СокрЛП(ИнвентарныйНомер) + "%";
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ОстаткиНаСкладеОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер
		|ИЗ
		|	РегистрНакопления.ЭП_ОстаткиНаСкладе.Остатки КАК ЭП_ОстаткиНаСкладеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
		|		ПО ЭП_ОстаткиНаСкладеОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
		|ГДЕ
		|	ЭП_ОстаткиНаСкладеОстатки.ИнвентарныйНомер ПОДОБНО &ИнвентарныйНомер
		|	И ЭП_ОстаткиНаСкладеОстатки.КоличествоОстаток > 0
		|	И (&НеПроверятьВидНоменклатуры или ЭП_Номенклатура.ВидНоменклатуры = &ВидНоменклатуры)
		|	И (&НеПроверятьНоменклатура или ЭП_Номенклатура.Ссылка = &Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭП_ОстаткиНаСотрудникахОстатки.ИнвентарныйНомер
		|ИЗ
		|	РегистрНакопления.ЭП_ОстаткиНаСотрудниках.Остатки КАК ЭП_ОстаткиНаСотрудникахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
		|		ПО ЭП_ОстаткиНаСотрудникахОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
		|ГДЕ
		|	ЭП_ОстаткиНаСотрудникахОстатки.ИнвентарныйНомер ПОДОБНО &ИнвентарныйНомер
		|	И ЭП_ОстаткиНаСотрудникахОстатки.КоличествоОстаток > 0
		|	И (&НеПроверятьВидНоменклатуры или ЭП_Номенклатура.ВидНоменклатуры = &ВидНоменклатуры)
		|	И (&НеПроверятьНоменклатура или ЭП_Номенклатура.Ссылка = &Ссылка)";
		
		Запрос.УстановитьПараметр("ИнвентарныйНомер", ИнвентарныйНомер);
		Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);  
		Запрос.УстановитьПараметр("Ссылка", Номенклатура);
		
		Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			Запрос.УстановитьПараметр("НеПроверятьВидНоменклатуры", Истина);
		Иначе
			Запрос.УстановитьПараметр("НеПроверятьВидНоменклатуры", Ложь);
		КонецЕсли; 
		
		Если не ЗначениеЗаполнено(Номенклатура) Тогда
			Запрос.УстановитьПараметр("НеПроверятьНоменклатура", Истина);	
		Иначе
			Запрос.УстановитьПараметр("НеПроверятьНоменклатура", Ложь);	
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Представление = Выборка.ИнвентарныйНомер;            
			СписокВыбора.Добавить(Выборка.ИнвентарныйНомер, Представление);    
			
		КонецЦикла; 
		
		Возврат СписокВыбора;
		
	Иначе	
		//  Ветка для подбора инвентарных номеров с привязкой к складу или сотруднику	
		
		Если НЕ ЗначениеЗаполнено(СокрЛП(ИнвентарныйНомер)) Тогда
			Возврат Неопределено;    
		Иначе
			ИнвентарныйНомер =  СокрЛП(ИнвентарныйНомер) + "%";
		КонецЕсли;

		
		Если РежимРаботы = Истина И ЗначениеЗаполнено(ВидНоменклатуры) = Истина Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭП_ОстаткиНаСкладеОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер
			|ИЗ
			|	РегистрНакопления.ЭП_ОстаткиНаСкладе.Остатки КАК ЭП_ОстаткиНаСкладеОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
			|		ПО ЭП_ОстаткиНаСкладеОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
			|ГДЕ
			|	ЭП_ОстаткиНаСкладеОстатки.ИнвентарныйНомер ПОДОБНО &ИнвентарныйНомер
			|	И ЭП_ОстаткиНаСкладеОстатки.Склад = &Склад
			|	И ЭП_ОстаткиНаСкладеОстатки.КоличествоОстаток > 0
			|	И ЭП_Номенклатура.ВидНоменклатуры = &ВидНоменклатуры";
			
			Запрос.УстановитьПараметр("Склад", Склад);
			Запрос.УстановитьПараметр("ИнвентарныйНомер", ИнвентарныйНомер);
			Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Представление = Выборка.ИнвентарныйНомер;            
				СписокВыбора.Добавить(Выборка.ИнвентарныйНомер, Представление);    
				
			КонецЦикла; 
			
			Возврат СписокВыбора;
			
		ИначеЕсли РежимРаботы = Истина И ЗначениеЗаполнено(ВидНоменклатуры) = Ложь Тогда  
			
			Запрос = Новый Запрос;		
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭП_ОстаткиНаСкладеОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер
			|ИЗ
			|	РегистрНакопления.ЭП_ОстаткиНаСкладе.Остатки КАК ЭП_ОстаткиНаСкладеОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
			|		ПО ЭП_ОстаткиНаСкладеОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
			|ГДЕ
			|	ЭП_ОстаткиНаСкладеОстатки.ИнвентарныйНомер ПОДОБНО &ИнвентарныйНомер
			|	И ЭП_ОстаткиНаСкладеОстатки.Склад = &Склад
			|	И ЭП_ОстаткиНаСкладеОстатки.КоличествоОстаток > 0";		
			
			Запрос.УстановитьПараметр("Склад", Склад);
			Запрос.УстановитьПараметр("ИнвентарныйНомер", ИнвентарныйНомер);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Представление = Выборка.ИнвентарныйНомер;            
				СписокВыбора.Добавить(Выборка.ИнвентарныйНомер, Представление);    
				
			КонецЦикла; 
			
			Возврат СписокВыбора; 
			
		ИначеЕсли РежимРаботы = Ложь И ЗначениеЗаполнено(ВидНоменклатуры) = Истина Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст  = "ВЫБРАТЬ
			|	ЭП_ОстаткиНаСотрудникахОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер
			|ИЗ
			|	РегистрНакопления.ЭП_ОстаткиНаСотрудниках.Остатки КАК ЭП_ОстаткиНаСотрудникахОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
			|		ПО ЭП_ОстаткиНаСотрудникахОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
			|ГДЕ
			|	ЭП_ОстаткиНаСотрудникахОстатки.ИнвентарныйНомер ПОДОБНО &ИнвентарныйНомер
			|	И ЭП_ОстаткиНаСотрудникахОстатки.КоличествоОстаток > 0
			|	И ЭП_ОстаткиНаСотрудникахОстатки.Сотрудник = &Сотрудник
			|	И ЭП_Номенклатура.ВидНоменклатуры = &ВидНоменклатуры";
			
			Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
			Запрос.УстановитьПараметр("ИнвентарныйНомер", ИнвентарныйНомер);
			Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Представление = Выборка.ИнвентарныйНомер;            
				СписокВыбора.Добавить(Выборка.ИнвентарныйНомер, Представление);    
				
			КонецЦикла; 
			
			Возврат СписокВыбора;
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст  = "ВЫБРАТЬ
			|	ЭП_ОстаткиНаСотрудникахОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер
			|ИЗ
			|	РегистрНакопления.ЭП_ОстаткиНаСотрудниках.Остатки КАК ЭП_ОстаткиНаСотрудникахОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
			|		ПО ЭП_ОстаткиНаСотрудникахОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
			|ГДЕ
			|	ЭП_ОстаткиНаСотрудникахОстатки.ИнвентарныйНомер ПОДОБНО &ИнвентарныйНомер
			|	И ЭП_ОстаткиНаСотрудникахОстатки.КоличествоОстаток > 0
			|	И ЭП_ОстаткиНаСотрудникахОстатки.Сотрудник = &Сотрудник";
			
			Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
			Запрос.УстановитьПараметр("ИнвентарныйНомер", ИнвентарныйНомер);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Представление = Выборка.ИнвентарныйНомер;            
				СписокВыбора.Добавить(Выборка.ИнвентарныйНомер, Представление);    
				
			КонецЦикла; 
			
			Возврат СписокВыбора;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецФункции
